
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    // При перепроведении очищаем движения
    Движения.ОстаткиМатериалов.Очистить();
    Движения.ОстаткиМатериалов.Записывать = Истина;

    // Регистр ОстаткиМатериалов: РАСХОД
    Для каждого Стр Из ТабличнаяЧасть Цикл

        Движение = Движения.ОстаткиМатериалов.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период      = Дата;
        Движение.Склад       = Склад;
        Движение.Материал    = Стр.Материал;
        Движение.Количество  = Стр.Количество;

    КонецЦикла;

КонецПроцедуры
