
&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)

	Если НЕ ЗначениеЗаполнено(Объект.Должность) Тогда
		Объект.Оклад = 0;
		Возврат;
	КонецЕсли;
	
	Объект.Оклад = ПолучитьОкладДолжности(Объект.Должность);

КонецПроцедуры

&НаСервере
Функция ПолучитьОкладДолжности(ДолжностьСсылка) Экспорт

	Если НЕ ЗначениеЗаполнено(ДолжностьСсылка) Тогда
		Возврат 0;
	КонецЕсли;

	Попытка
		ДолжнОбъект = ДолжностьСсылка.ПолучитьОбъект(); 
		Возврат ДолжнОбъект.Оклад;
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции
