
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ Из ТабличнаяЧасть Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = СкладОткуда;
		Движение.Материал = ТекСтрокаТЧ.Материал;
		Движение.Количество = ТекСтрокаТЧ.Количество;
	КонецЦикла;

	// регистр ОстаткиМатериалов Приход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ Из ТабличнаяЧасть Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = СкладКуда;
		Движение.Материал = ТекСтрокаТЧ.Материал;
		Движение.Количество = ТекСтрокаТЧ.Количество;
	КонецЦикла;

КонецПроцедуры
