
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    // чтобы при перепроведении не было дублей
    Движения.ОстаткиМатериалов.Очистить();
    Движения.ОстаткиМатериалов.Записывать = Истина;

    // Регистр ОстаткиМатериалов: ПРИХОД
    Для каждого ТекСтрокаМатериалы Из Материалы Цикл

        Движение = Движения.ОстаткиМатериалов.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период      = Дата;
        Движение.Склад       = Склад;
        Движение.Материал    = ТекСтрокаМатериалы.Материал;
        Движение.Количество  = ТекСтрокаМатериалы.Количество;
        Движение.Сумма       = ТекСтрокаМатериалы.Сумма;

    КонецЦикла;

КонецПроцедуры
