
&НаКлиенте
Процедура ТабличнаяЧастьКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТабличнаяЧасть.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТабличнаяЧасть.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		
	КонецЕсли;	
	
КонецПроцедуры
